[
    {
        "id": "624abf0e929f10130f70394e",
        "name": "Harvey Herman",
        "main": "Huge Range Improvements",
        "comment": "For all the hobbyists this is probably a great drone. I'm not a hobbyist and purchased this to take aerial photos of homes that I sell and probably would never operate it higher than about 75-100'. Unfortunately, what isn't mentioned here is that this product has many restrictions called geo zones which render this drone useless in quite a few areas."
    },
    {
        "id": "624abf0e20f2ac4b52f72be4",
        "name": "Horn Hampton",
        "main": " Fun, full-featured drone in a small, portable package",
        "comment": "Incredible. For all those wondering “what’s the difference in the original Mavic mini and the Mini 2?” The mini 2 basically just improved everywhere the original lacked. The things that are notable are Ocusync 2, 4K video, big increase in wind resistance, and quick shots. As well as longer flight time and stronger propellor motors."
    },
    {
        "id": "624abf0e5f48b698b623f9a3",
        "name": "Jane Avery",
        "main": "Bigger is not always better",
        "comment": "For all the hobbyists this is probably a great drone. I'm not a hobbyist and purchased this to take aerial photos of homes that I sell and probably would never operate it higher than about 75-100'. Unfortunately, what isn't mentioned here is that this product has many restrictions called geo zones which render this drone useless in quite a few areas"
    },
    {
        "id": "624abf0e33b0aea60900a403",
        "name": "Chandra Salazar",
        "main": "RECEIVED USED/RETURNED DRONE! BEWARE.",
        "comment": "I am a professional video producer who does a lot of travel related videos. My most recent drone was a DJI Phantom 4 and LOVED it but even with the backpack I bought for it, was too large to hike with when I also had my camera equipment."
    },
    {
        "id": "624abf0eeeac0ee299194605",
        "name": "Sadie Patrick",
        "main": "**BEWARE** CONTROL MALFUNCTION / CRASH",
        "comment": "As an avid photographer who is new to aerial photography, I am delighted with the DJI Mini 2. It is easy to fly--I even took it out over water on my first flight, although briefly and controlled in Cine mode. Despite the small, compact size, it is surprisingly stable and takes sharp images, even in some wind."
    },
    {
        "id": "624abf0e631c43c7d3f6e6ab",
        "name": "Lisa Huff",
        "main": "First impression compared to the original Mavic Mini",
        "comment": "Significant upgrades across the board when compared to the Mini 1. The main one is definitely Ocusync 2.0, which is a tremendous improvement from the Wifi system utilized in the Mini 1. Everything else was bumped up a bit as well: 4k camera, improved top speed, implementation of RAW image format. It's basically what the Mini 1 should have been."
    },
    {
        "id": "624abf0e53c440cd3678f984",
        "name": "Jami Hurley",
        "main": " Contacto con el vendedor",
        "comment": "Be honest I was skeptical about ordering this not from DJI directly. But I’m glad I didn’t because it would have taken so much longer (about 2 weeks) to get this from DJI. I was too excited and don’t want to wait that long and this seller seem very respectable plus if something do go side way I know Amazon and maybe the seller will make it right."
    },
    {
        "id": "624abf0e476165dc737551d2",
        "name": "Langley Parrish",
        "main": "Bigger is not always better",
        "comment": "Necesito contactar con el vendedor y no existe manera, el drone sufrio una ruptura en el estabilizador, adquiri tambien el seguro assurant el cual no me cubre nada hasta que la garantia del fabricante expire (lo cual es ilogico porque te lo venden por 2 años y la garantia del fabricante es de 1 año) en fin "
    }
]